[Killed] Block removal mutation
DomovoiBackend.Application/Services/CounterAgentServices/CounterAgentService.cs:28:5
     private readonly ICounterAgentMappingService _mappingService;
 
     public CounterAgentService(ICounterAgentRepository repository, ICounterAgentMappingService mappingService)
-    {
-        _repository = repository;
-        _mappingService = mappingService;
-    }
+    {}
 
     public async Task<CounterAgentInformation> AddAsync(AddCounterAgentRequest request, CancellationToken cancellationToken)
killedBy: DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddLegalCounterAgentTest; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddPhysicalCounterAgentTest; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_CorrectLoginTest

[Killed] Negate expression
DomovoiBackend.Application/Services/CounterAgentServices/CounterAgentService.cs:35:13
 
     public async Task<CounterAgentInformation> AddAsync(AddCounterAgentRequest request, CancellationToken cancellationToken)
     {
-        if (await _repository.IsExistAsync(request.Email, cancellationToken))
+        if (!(await _repository.IsExistAsync(request.Email, cancellationToken)))
         {
             throw new UserExistException(request.Email);
killedBy: DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddLegalCounterAgentTest; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddPhysicalCounterAgentTest; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_TryTwiceAddPhysicalCounterAgentTest

[Killed] Statement mutation
DomovoiBackend.Application/Services/CounterAgentServices/CounterAgentService.cs:37:13
     {
         if (await _repository.IsExistAsync(request.Email, cancellationToken))
         {
-            throw new UserExistException(request.Email);
+            ;
         }
         var counterAgent = _mappingService.MapEntityFromRequest(request);
killedBy: DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_TryTwiceAddPhysicalCounterAgentTest

[Killed] Statement mutation
DomovoiBackend.Application/Services/CounterAgentServices/CounterAgentService.cs:40:9
             throw new UserExistException(request.Email);
         }
         var counterAgent = _mappingService.MapEntityFromRequest(request);
-        await _repository.AddAsync(counterAgent, cancellationToken);
+        ;
         return _mappingService.MapInformationFromEntity(counterAgent);
     }
killedBy: DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_TryTwiceAddPhysicalCounterAgentTest

[Killed] Block removal mutation
DomovoiBackend.Application/Services/CounterAgentServices/CounterAgentService.cs:45:5
     }
 
     public async Task<CounterAgentInformation> LoginAsync(AuthorizationRequest request, CancellationToken cancellationToken)
-    {
-        var counterAgent =
-            await _repository.GetCounterAgentByAuthDataAsync(request.Email, request.Password, cancellationToken);
-        return _mappingService.MapInformationFromEntity(counterAgent);
-    }
+    {}
 
     public async Task UpdateAsync(Guid id, CounterAgentUpdateRequest information, CancellationToken cancellationToken)
killedBy: DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_LoginNotExistCounterAgentTest; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_LoginWithIncorrectPasswordTest

[Killed] Statement mutation
DomovoiBackend.Application/Services/CounterAgentServices/CounterAgentService.cs:55:9
     {
         var counterAgent = _mappingService.MapEntityFromRequest(information);
         counterAgent.Id = id;
-        await _repository.UpdateCounterAgentAsync(counterAgent, cancellationToken);
+        ;
     }
 
killedBy: DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_UpdateCounterAgent; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_UpdateCounterAgentWithWrongId

[NoCoverage] Block removal mutation
DomovoiBackend.Application/Services/CounterAgentServices/CounterAgentService.cs:62:5
         await _repository.RemoveCounterAgentAsync(id, cancellationToken);
 
     public async Task<CounterAgentInformation> GetCounterAgentInfoAsync(Guid id, CancellationToken cancellationToken)
-    {
-        var counterAgent = await _repository.GetCounterAgentAsync(id, cancellationToken);
-        var counterAgentInformation = _mappingService.MapInformationFromEntity(counterAgent);
-        return counterAgentInformation;
-    }
+    {}
 }
