[NoCoverage] Statement mutation
RiderProjects/DomovoiBackend/DomovoiBackend.Application/DependencyInjection.cs:25:9
     /// <returns>Коллекция сервисов.</returns>
     public static IServiceCollection AddApplicationLayer(this IServiceCollection services)
     {
-        services.AddScoped<IAnnouncementService, AnnouncementService>();
+        ;
         services.AddScoped<ICounterAgentService, CounterAgentService>();
         return services;

[NoCoverage] Statement mutation
RiderProjects/DomovoiBackend/DomovoiBackend.Application/DependencyInjection.cs:26:9
     public static IServiceCollection AddApplicationLayer(this IServiceCollection services)
     {
         services.AddScoped<IAnnouncementService, AnnouncementService>();
-        services.AddScoped<ICounterAgentService, CounterAgentService>();
+        ;
         return services;
     }

[NoCoverage] Statement mutation
RiderProjects/DomovoiBackend/DomovoiBackend.Application/DependencyInjection.cs:37:9
     /// <returns>Коллекция сервисов.</returns>
     public static IServiceCollection AddMappers(this IServiceCollection services)
     {
-        services.AddAutoMapper(config => config.AddProfile(
-            new AssemblyMappingProfile(Assembly.GetExecutingAssembly())));
+        ;
         services.AddScoped<ICounterAgentMappingService, CounterAgentMappingService>();
         services.AddScoped<IDealMappingService, DealMappingService>();

[NoCoverage] Statement mutation
RiderProjects/DomovoiBackend/DomovoiBackend.Application/DependencyInjection.cs:39:9
     {
         services.AddAutoMapper(config => config.AddProfile(
             new AssemblyMappingProfile(Assembly.GetExecutingAssembly())));
-        services.AddScoped<ICounterAgentMappingService, CounterAgentMappingService>();
+        ;
         services.AddScoped<IDealMappingService, DealMappingService>();
         services.AddScoped<IRealityMappingService, RealityMappingService>();

[NoCoverage] Statement mutation
RiderProjects/DomovoiBackend/DomovoiBackend.Application/DependencyInjection.cs:40:9
         services.AddAutoMapper(config => config.AddProfile(
             new AssemblyMappingProfile(Assembly.GetExecutingAssembly())));
         services.AddScoped<ICounterAgentMappingService, CounterAgentMappingService>();
-        services.AddScoped<IDealMappingService, DealMappingService>();
+        ;
         services.AddScoped<IRealityMappingService, RealityMappingService>();
         return services;

[NoCoverage] Statement mutation
RiderProjects/DomovoiBackend/DomovoiBackend.Application/DependencyInjection.cs:41:9
             new AssemblyMappingProfile(Assembly.GetExecutingAssembly())));
         services.AddScoped<ICounterAgentMappingService, CounterAgentMappingService>();
         services.AddScoped<IDealMappingService, DealMappingService>();
-        services.AddScoped<IRealityMappingService, RealityMappingService>();
+        ;
         return services;
     }
