[Killed] Linq method mutation (Any() to All())
DomovoiBackend/DomovoiBackend.Application/Mapping/AssemblyMappingProfile.cs:23:25
     {
         var types = assembly
             .GetTypes()
-            .Where(t => t.GetInterfaces()
-                .Any(i => i.IsGenericType &&
+            .Where(t => t.GetInterfaces()
+                .All(i => i.IsGenericType &&
                            i.GetGenericTypeDefinition() == typeof(IMapTwoSide<>)))
             .ToList();
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Sell",0)

[Killed] Logical mutation
DomovoiBackend/DomovoiBackend.Application/Mapping/AssemblyMappingProfile.cs:24:27
         var types = assembly
             .GetTypes()
             .Where(t => t.GetInterfaces()
-                .Any(i => i.IsGenericType &&
-                           i.GetGenericTypeDefinition() == typeof(IMapTwoSide<>)))
+                .Any(i => i.IsGenericType ||
+                           i.GetGenericTypeDefinition() == typeof(IMapTwoSide<>)))
             .ToList();
 
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Sell",0)

[Killed] Equality mutation
DomovoiBackend/DomovoiBackend.Application/Mapping/AssemblyMappingProfile.cs:25:28
             .GetTypes()
             .Where(t => t.GetInterfaces()
                 .Any(i => i.IsGenericType &&
-                           i.GetGenericTypeDefinition() == typeof(IMapTwoSide<>)))
+                           i.GetGenericTypeDefinition() != typeof(IMapTwoSide<>)))
             .ToList();
 
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)

[Killed] Statement mutation
DomovoiBackend/DomovoiBackend.Application/Mapping/AssemblyMappingProfile.cs:31:13
         foreach (var type in types)
         {
             var instance = Activator.CreateInstance(type)!;
-            (instance as IMapTwoSide)?.Mapping(this);
+            ;
         }
     }
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)
