[Killed] Statement mutation
DomovoiBackend.Application/Mapping/Interfaces/IMapTwoSide.cs:17:9
     /// <param name="profile">Профиль автомапера.</param>
     public new void Mapping(Profile profile)
     {
-        profile.CreateMap(typeof(T), GetType());
+        ;
         profile.CreateMap(GetType(), typeof(T));
     }
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)

[Killed] Statement mutation
DomovoiBackend.Application/Mapping/Interfaces/IMapTwoSide.cs:18:9
     public new void Mapping(Profile profile)
     {
         profile.CreateMap(typeof(T), GetType());
-        profile.CreateMap(GetType(), typeof(T));
+        ;
     }
 
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_UpdateAnnouncement; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddLegalCounterAgentTest
