[Killed] Linq method mutation (Any() to All())
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:35:28
         var mapToInterfaceDefinition = typeof(IMapTwoSide<>);
 
         var types = assembly.GetTypes()
-            .Where(type => type.GetInterfaces()
-                .Any(i => i.IsGenericType &&
+            .Where(type => type.GetInterfaces()
+                .All(i => i.IsGenericType &&
                           i.GetGenericTypeDefinition() == mapToInterfaceDefinition));
         
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)

[Killed] Logical mutation
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:36:27
 
         var types = assembly.GetTypes()
             .Where(type => type.GetInterfaces()
-                .Any(i => i.IsGenericType &&
-                          i.GetGenericTypeDefinition() == mapToInterfaceDefinition));
+                .Any(i => i.IsGenericType ||
+                          i.GetGenericTypeDefinition() == mapToInterfaceDefinition));
         
         var resultDictionary = new Dictionary<Type, Func<IMapperBase, object, TDestination>>();
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)

[Killed] Equality mutation
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:37:27
         var types = assembly.GetTypes()
             .Where(type => type.GetInterfaces()
                 .Any(i => i.IsGenericType &&
-                          i.GetGenericTypeDefinition() == mapToInterfaceDefinition));
+                          i.GetGenericTypeDefinition() != mapToInterfaceDefinition));
         
         var resultDictionary = new Dictionary<Type, Func<IMapperBase, object, TDestination>>();
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest

[Survived] Linq method mutation (First() to FirstOrDefault())
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:43:38
         
         foreach (var type in types)
         {
-            var destinationMapType = type.GetInterfaces()
-                .First(i => i.GetGenericTypeDefinition() == mapToInterfaceDefinition)
+            var destinationMapType = type.GetInterfaces()
+                .FirstOrDefault(i => i.GetGenericTypeDefinition() == mapToInterfaceDefinition)
                 .GetGenericArguments()[0];
             

[Killed] Equality mutation
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:44:29
         foreach (var type in types)
         {
             var destinationMapType = type.GetInterfaces()
-                .First(i => i.GetGenericTypeDefinition() == mapToInterfaceDefinition)
+                .First(i => i.GetGenericTypeDefinition() != mapToInterfaceDefinition)
                 .GetGenericArguments()[0];
             
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)

[Killed] Statement mutation
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:64:13
                 sourceObjectParameter)
                 .Compile();
             
-            resultDictionary.Add(type, compiled);
+            ;
         }
 
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_UpdateAnnouncement; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddLegalCounterAgentTest

[Killed] Logical mutation
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:81:28
         var mapToInterfaceDefinition = typeof(IMapTwoSide<>);
 
         var types = assembly.GetTypes()
-            .Where(type => type.IsSubclassOf(typeof(TSource)) &&
-                type.GetInterfaces()
-                .Any(i => i.IsGenericType &&
-                          i.GetGenericTypeDefinition() == mapToInterfaceDefinition));
+            .Where(type => type.IsSubclassOf(typeof(TSource)) ||
+                type.GetInterfaces()
+                .Any(i => i.IsGenericType &&
+                          i.GetGenericTypeDefinition() == mapToInterfaceDefinition));
         
         var resultDictionary = new Dictionary<Type, Func<IMapperBase, object, TSource>>();
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)

[Killed] Linq method mutation (Any() to All())
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:82:17
 
         var types = assembly.GetTypes()
             .Where(type => type.IsSubclassOf(typeof(TSource)) &&
-                type.GetInterfaces()
-                .Any(i => i.IsGenericType &&
+                type.GetInterfaces()
+                .All(i => i.IsGenericType &&
                           i.GetGenericTypeDefinition() == mapToInterfaceDefinition));
         
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)

[Survived] Logical mutation
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:83:27
         var types = assembly.GetTypes()
             .Where(type => type.IsSubclassOf(typeof(TSource)) &&
                 type.GetInterfaces()
-                .Any(i => i.IsGenericType &&
-                          i.GetGenericTypeDefinition() == mapToInterfaceDefinition));
+                .Any(i => i.IsGenericType ||
+                          i.GetGenericTypeDefinition() == mapToInterfaceDefinition));
         
         var resultDictionary = new Dictionary<Type, Func<IMapperBase, object, TSource>>();

[Survived] Linq method mutation (First() to FirstOrDefault())
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:90:33
         
         foreach (var type in types)
         {
-            var sourceMapType = type.GetInterfaces()
-                .First(i => i.IsGenericType && i.GetGenericTypeDefinition() == mapToInterfaceDefinition)
+            var sourceMapType = type.GetInterfaces()
+                .FirstOrDefault(i => i.IsGenericType && i.GetGenericTypeDefinition() == mapToInterfaceDefinition)
                 .GetGenericArguments()[0];
             

[Killed] Equality mutation
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:91:48
         foreach (var type in types)
         {
             var sourceMapType = type.GetInterfaces()
-                .First(i => i.IsGenericType && i.GetGenericTypeDefinition() == mapToInterfaceDefinition)
+                .First(i => i.IsGenericType && i.GetGenericTypeDefinition() != mapToInterfaceDefinition)
                 .GetGenericArguments()[0];
             
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)

[Survived] Logical mutation
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:91:29
         foreach (var type in types)
         {
             var sourceMapType = type.GetInterfaces()
-                .First(i => i.IsGenericType && i.GetGenericTypeDefinition() == mapToInterfaceDefinition)
+                .First(i => i.IsGenericType || i.GetGenericTypeDefinition() == mapToInterfaceDefinition)
                 .GetGenericArguments()[0];
             

[Killed] Statement mutation
DomovoiBackend.Application/Mapping/Tools/MapCollector.cs:111:13
                     sourceObjectParameter)
                 .Compile();
             
-            resultDictionary.Add(sourceMapType, compiled);
+            ;
         }
 
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType(null,3)
