[Killed] Block removal mutation
DomovoiBackend.Application/Services/AnnouncementServices/AnnouncementService.cs:43:5
 
     public AnnouncementService(IDealMappingService dealMappingService, IRealityMappingService realityMappingService,
         IAnnouncementRepository announcementRepository, ICounterAgentRepository counterAgentRepository, ICounterAgentMappingService counterAgentMappingService)
-    {
-        _dealMappingService = dealMappingService;
-        _realityMappingService = realityMappingService;
-        _announcementRepository = announcementRepository;
-        _counterAgentRepository = counterAgentRepository;
-        _counterAgentMappingService = counterAgentMappingService;
-    }
+    {}
 
     public async Task<Guid> AddAnnouncementAsync(AddAnnouncementRequest request, CancellationToken cancellationToken)
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Rent",3); DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByDealType("Sell",0)

[Killed] Statement mutation
DomovoiBackend.Application/Services/AnnouncementServices/AnnouncementService.cs:70:9
             CounterAgent = counterAgent
         };
 
-        await _announcementRepository.AddAnnouncementAsync(announcement, cancellationToken);
+        ;
         
         return announcementGuid;
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest

[Killed] Object initializer mutation
DomovoiBackend.Application/Services/AnnouncementServices/AnnouncementService.cs:106:16
 
         var announcementInfos = announcements.Select(TransformToInformation).ToList();
 
-        return new AnnouncementInformationCollection { AnnouncementInformation = announcementInfos };
+        return new AnnouncementInformationCollection {};
     }
 
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_RemoveAnnouncement

[Killed] Statement mutation
DomovoiBackend.Application/Services/AnnouncementServices/AnnouncementService.cs:147:9
             CounterAgent = counterAgent
         };
 
-        await _announcementRepository.UpdateAnnouncementAsync(announcementId, announcement, cancellationToken);
+        ;
     }
 
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_UpdateAnnouncement

[Killed] Object initializer mutation
DomovoiBackend.Application/Services/AnnouncementServices/AnnouncementService.cs:170:16
 
         var announcementInfos = announcements.Select(TransformToInformation).ToList();
 
-        return new AnnouncementInformationCollection() { AnnouncementInformation = announcementInfos };
+        return new AnnouncementInformationCollection() {};
     }
 
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByUserId
