[NoCoverage] Block removal mutation
DomovoiBackend.Application/Services/MappingServices/CounterAgentMappingService.cs:37:5
     public CounterAgentMappingService(IMapper mapper) => _mapper = mapper;
 
     public CounterAgent MapEntityFromInformation(CounterAgentInformation information)
-    {
-        var counterAgentInformationType = information.GetType();
-        var counterAgent = ToCounterAgentMapDictionary[counterAgentInformationType](_mapper, information);
-        return counterAgent;
-    }
+    {}
 
     public CounterAgentInformation MapInformationFromEntity(CounterAgent counterAgent)

[Killed] Block removal mutation
DomovoiBackend.Application/Services/MappingServices/CounterAgentMappingService.cs:44:5
     }
 
     public CounterAgentInformation MapInformationFromEntity(CounterAgent counterAgent)
-    {
-        var counterAgentType = counterAgent.GetType();
-        var counterAgentInformation = ToCounterAgentInformationMapDictionary[counterAgentType](_mapper, counterAgent);
-        return counterAgentInformation;
-    }
+    {}
 
     public CounterAgent MapEntityFromRequest(AddCounterAgentRequest request)
killedBy: DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddLegalCounterAgentTest; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddPhysicalCounterAgentTest

[Killed] Block removal mutation
DomovoiBackend.Application/Services/MappingServices/CounterAgentMappingService.cs:51:5
     }
 
     public CounterAgent MapEntityFromRequest(AddCounterAgentRequest request)
-    {
-        var requestType = request.GetType();
-        var counterAgent = ToCounterAgentMapDictionary[requestType](_mapper, request);
-        return counterAgent;
-    }
+    {}
 
     public CounterAgent MapEntityFromRequest(CounterAgentUpdateRequest request)
killedBy: DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddLegalCounterAgentTest; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_AddPhysicalCounterAgentTest; DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_TryTwiceAddPhysicalCounterAgentTest

[Killed] Block removal mutation
DomovoiBackend.Application/Services/MappingServices/CounterAgentMappingService.cs:58:5
     }
 
     public CounterAgent MapEntityFromRequest(CounterAgentUpdateRequest request)
-    {
-        var requestType = request.GetType();
-        var counterAgent = ToCounterAgentMapDictionary[requestType](_mapper, request);
-        return counterAgent;
-    }
+    {}
 }
killedBy: DomovoiBackend.Application.Tests.Services.Tests.CounterAgentServiceTests.CounterAgentService_UpdateCounterAgent
