[Killed] Block removal mutation
DomovoiBackend.Application/Services/MappingServices/DealMappingService.cs:35:5
     public DealMappingService(IMapper mapper) => _mapper = mapper;
 
     public Deal MapEntityFromInformation(DealInformation information)
-    {
-        var dealInformationType = information.GetType();
-        var deal = ToDealMapDictionary[dealInformationType](_mapper, information);
-        return deal;
-    }
+    {}
 
     public DealInformation MapInformationFromEntity(Deal deal)
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest

[Killed] Block removal mutation
DomovoiBackend.Application/Services/MappingServices/DealMappingService.cs:42:5
     }
 
     public DealInformation MapInformationFromEntity(Deal deal)
-    {
-        var dealType = deal.GetType();
-        var dealInformation = ToDealInformationMapDictionary[dealType](_mapper, deal);
-        return dealInformation;
-    }
+    {}
 }
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByEndPrice; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_GetAnnouncementsByStartPrice
