[Killed] Block removal mutation
DomovoiBackend.Application/Services/MappingServices/RealityMappingService.cs:35:5
     public RealityMappingService(IMapper mapper) => _mapper = mapper;
     
     public Reality MapEntityFromInformation(RealityInformation information)
-    {
-        var realityInformationType = information.GetType();
-        var reality = ToRealityMapDictionary[realityInformationType](_mapper, information);
-        return reality;
-    }
+    {}
 
     public RealityInformation MapInformationFromEntity(Reality reality)
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest; DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_UpdateAnnouncement

[Killed] Block removal mutation
DomovoiBackend.Application/Services/MappingServices/RealityMappingService.cs:42:5
     }
 
     public RealityInformation MapInformationFromEntity(Reality reality)
-    {
-        var realityType = reality.GetType();
-        var realityInformation = ToRealityInformationMapDictionary[realityType](_mapper, reality);
-        return realityInformation;
-    }
+    {}
 }
killedBy: DomovoiBackend.Application.Tests.Services.Tests.AnnouncementServiceTests.AnnouncementService_AddAnnouncementTest
